yannickmayannick/circuitpython/ports/atmel-samd/boards/rapid0_adcs/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "RAPID-0 ADCS"
#define MICROPY_HW_MCU_NAME "samd51n20"

#define CIRCUITPY_MCU_FAMILY samd51

// This is for Rev F which is green

#define MICROPY_HW_LED_TX   (&pin_PA27)
#define MICROPY_HW_LED_RX   (&pin_PB06)

#define MICROPY_HW_LED_STATUS   (&pin_PA16)

#define MICROPY_HW_NEOPIXEL (&pin_PB22)

#define BOARD_HAS_CRYSTAL 0

#define DEFAULT_I2C_BUS_SCL (&pin_PB03)
#define DEFAULT_I2C_BUS_SDA (&pin_PB02)

#define DEFAULT_SPI_BUS_SCK (&pin_PA13)
#define DEFAULT_SPI_BUS_MOSI (&pin_PA12)
#define DEFAULT_SPI_BUS_MISO (&pin_PA14)

#define DEFAULT_UART_BUS_RX (&pin_PA23)
#define DEFAULT_UART_BUS_TX (&pin_PA22)

// USB is always used internally so skip the pin objects for it.
#define IGNORE_PIN_PA24     1
#define IGNORE_PIN_PA25     1
